### 5.Retrieve the name of the employee who has generated the highest sales revenue in the year 2013.

- ##### Hint: Revenue = SUM(invoice_item.Quantity * invoice_item.UnitPrice). <br>You will need to join the `employees`, `customers`, `invoices`, and `invoice_items` tables and use the WHERE and GROUP BY clauses to filter for sales made in the year 2013 and aggregate the total sales made by each employee.

## Expected Output


   | TopSalesPerson         | TotalRevenue |
   |------------------------|--------------|
   | Margaret Park          | 168.3        |

In [1]:
%run setup_notebook.ipynb

In [2]:
%%sql 

SELECT *
FROM employees
LIMIT 1;

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
1 rows affected.

[(1, 'Adams', 'Andrew', 'General Manager', None, '1962-02-18 00:00:00', '2002-08-14 00:00:00', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com')]

In [3]:
%%sql

SELECT *
FROM customers
LIMIT 1;

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
1 rows affected.

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3)]

In [4]:
%%sql

SELECT *
FROM invoices
LIMIT 1;

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
1 rows affected.

[(1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 1.98)]

In [5]:
%%sql

SELECT *
FROM invoice_items
LIMIT 1;

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
1 rows affected.

[(1, 1, 2, 0.99, 1)]

In [6]:
%%sql 
-- Get the year

SELECT YEAR(i.InvoiceDate)
FROM invoices i 
LIMIT 2

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
2 rows affected.

[(2009,), (2009,)]

In [7]:
%%sql 
-- Concatenate the required column name.

SELECT CONCAT(e.FirstName,' ', e.LastName) AS TopSalesPerson
FROM employees e 
LIMIT 2

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
2 rows affected.

[('Andrew Adams',), ('Nancy Edwards',)]

In [8]:
%%sql 
-- Confirm that SupportRepId from `invoices` table reference EmployeeId from `employees` table.

SELECT CONCAT(e.FirstName,' ', e.LastName) AS TopSalesPerson, e.EmployeeId, c.SupportRepId
FROM employees e 
JOIN customers c ON e.EmployeeId = c.SupportRepId
LIMIT 2

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
2 rows affected.

[('Jane Peacock', 3, 3), ('Jane Peacock', 3, 3)]

In [9]:
%%sql 

SELECT SUM(inv.Quantity * inv.UnitPrice) AS TotalRevenue
FROM invoices i
JOIN invoice_items inv ON i.InvoiceId = inv.InvoiceId
WHERE YEAR(i.InvoiceDate) = 2013
LIMIT 3

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
1 rows affected.

[(450.58000000000254,)]

In [10]:
%%sql

SELECT 
CONCAT(e.FirstName, ' ', e.LastName) AS TopSalesPerson, 
SUM(inv.Quantity * inv.UnitPrice) AS TotalRevenue
FROM employees e
JOIN customers c ON e.EmployeeId = c.SupportRepId
JOIN invoices i ON c.CustomerId = i.CustomerId
JOIN invoice_items inv ON i.InvoiceId = inv.InvoiceId
WHERE YEAR(i.InvoiceDate) = 2013
GROUP BY e.EmployeeId
ORDER BY SUM(inv.UnitPrice * inv.Quantity) DESC;

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
3 rows affected.

[('Margaret Park', 168.30000000000007),
 ('Jane Peacock', 156.42999999999995),
 ('Steve Johnson', 125.84999999999972)]

In [11]:
%%sql

SELECT 
CONCAT(e.FirstName, ' ', e.LastName) AS TopSalesPerson, 
ROUND(SUM(inv.Quantity * inv.UnitPrice),2) AS TotalRevenue
FROM employees e
JOIN customers c ON e.EmployeeId = c.SupportRepId
JOIN invoices i ON c.CustomerId = i.CustomerId
JOIN invoice_items inv ON i.InvoiceId = inv.InvoiceId
WHERE YEAR(i.InvoiceDate) = 2013
GROUP BY e.EmployeeId
ORDER BY SUM(inv.UnitPrice * inv.Quantity) DESC
LIMIT 1;

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
1 rows affected.

[('Margaret Park', 168.3)]